agent_prefix = """Відповідайте на наступні питання якомога краще. У вас є доступ до наступних інструментів:"""

agent_format_instructions = """

Використовуйте наступний формат:

Question: вхідне питання, на яке ви повинні відповісти
Thought: ви завжди повинні думати, що робити
Action: дія, яку слід виконати, повинна бути однією з [{tool_names}]
Action Input: інпут до дії
Observation: результат дії
... (цей Thought/Action/Action Input/Observation може повторюватися N раз)
Thought: Тепер я знаю кінцеву відповідь
Final Answer: кінцева відповідь на початкове вхідне питання

Приклад:

Question: Давай практикувати відмінювання дієслів.
Thought: Користувач хоче відміняти дієслова. Маю вибрати інструмент, який допоможе мені відміняти дієслова.
Action: Вибрати інструмент "Відмінювання дієслів".
Action Input: Вхідне слово: "питати".

"""

agent_suffix = """
Почнімо!

Історія повідомлень:
{chat_history}


Question: {input}
Thought:{agent_scratchpad}
"""
